<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
     
  <meta name="lastupdate" content="15Apr2003">
  <title>Sun Legal Notices</title>
   
</head>
 <body bgcolor="#ffffff">

<p>Copyright 2004 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, 
California 95054, U.S.A. 

<p>All rights reserved. Sun Microsystems, Inc. has intellectual property rights 
relating to technology embodied in the product that is described in this 
document. In particular, and without limitation, these intellectual property 
rights may include one or more of the U.S. patents listed at 
<tt>http://www.sun.com/patents</tt> and one or more additional patents or 
pending patent applications in the U.S. and in other countries.

<p>THIS PRODUCT CONTAINS CONFIDENTIAL INFORMATION AND TRADE SECRETS OF SUN 
MICROSYSTEMS, INC. USE, DISCLOSURE OR REPRODUCTION IS PROHIBITED WITHOUT THE 
PRIOR EXPRESS WRITTEN PERMISSION OF SUN MICROSYSTEMS, INC.

<p>U.S. Government Rights - Commercial software. Government users are subject to 
the Sun Microsystems, Inc. standard license agreement and applicable provisions 
of the FAR and its supplements.
Use is subject to license terms. This distribution may include materials 
developed by third parties.

<p>Sun, Sun Microsystems, the Sun logo, Java, Solaris, Sun ONE, Sun ONE Studio, 
iPlanet, 
J2EE, J2SE, Enterprise JavaBeans, EJB, JavaServer Pages, JSP, JDBC, JDK, JVM, 
Java Naming and Directory Interface, and JavaMail are trademarks or registered 
trademarks of 
Sun Microsystems, Inc. in the U.S. and other countries.

<p>All SPARC trademarks are used under license and are trademarks or registered 
trademarks of SPARC International, Inc. in the U.S. and other countries. 
Products bearing SPARC trademarks are based upon architecture developed by Sun 
Microsystems, Inc.

<p>UNIX is a registered trademark in the U.S. and in other countries, 
exclusively licensed through X/Open Company, Ltd.

<p>This product is covered and controlled by U.S. Export Control laws and may be 
subject to the export 
or import laws in other countries.  Nuclear, missile, chemical biological 
weapons or 
nuclear maritime end uses or end users, whether direct or indirect, are strictly 
prohibited. Export or reexport to countries subject to U.S. embargo or 
to entities identified on U.S. export exclusion lists, including, but not 
limited to, the 
denied persons and specially designated nationals lists is strictly prohibited.

<p>DOCUMENTATION IS PROVIDED "AS IS" AND ALL EXPRESS OR IMPLIED CONDITIONS, 
REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF 
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, 
ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH DISCLAIMERS ARE HELD TO 
BE LEGALLY INVALID.
<hr>

<p>Copyright 2004 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, 
California 95054, Etats-Unis. Tous droits r&eacute;serv&eacute;s.

<p>Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; 
intellectuels relatifs &agrave; la technologie incorpor&eacute;e dans le produit 
qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, 
ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plus 
des brevets am&eacute;ricains list&eacute;s &agrave; l'adresse 
<tt>http://www.sun.com/patents</tt> et un ou les brevets suppl&eacute;mentaires 
ou les applications de brevet en attente aux Etats-Unis et dans les autres pays.

<p>CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS 
COMMERCIAUX DE SUN MICROSYSTEMS, INC. SON UTILISATION, SA DIVULGATION ET SA 
REPRODUCTION SONT INTERDITES SANS L'AUTORISATION EXPRESSE, &Eacute;CRITE ET 
PR&Eacute;ALABLE DE SUN MICROSYSTEMS, INC.

<p>L'utilisation est soumise aux termes de la Licence. Cette distribution peut 
comprendre des composants d&eacute;velopp&eacute;s par des tierces parties.

<p>Sun, Sun Microsystems, le logo Sun, Java, Solaris, Sun ONE, Sun ONE Studio, 
iPlanet, J2EE, J2SE, Enterprise JavaBeans, EJB, JavaServer Pages, JSP, JDBC, 
JDK, JVM, Java Naming and Directory Interface, et JavaMail sont des marques de 
fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux 
Etats-Unis et dans d'autres pays.

<p>Toutes les marques SPARC sont utilis&eacute;es sous licence et sont des 
marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC 
International, Inc. aux Etats-Unis et dans d'autres pays. Les produits portant 
les marques SPARC sont bas&eacute;s sur une architecture 
d&eacute;velopp&eacute;e par Sun Microsystems, Inc.

<p>UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d'autres 
pays et licenci&eacute;e exclusivement par X/Open Company, Ltd.

<p>Ce produit est soumis &agrave; la l&eacute;gislation am&eacute;ricaine en 
mati&egrave;re de contr&ocirc;le des exportations et peut &ecirc;tre soumis 
&agrave; la r&egrave;glementation en vigueur dans d'autres pays dans le domaine 
des exportations et importations. Les utilisations, ou utilisateurs finaux, pour 
des armes nucl&eacute;aires, des missiles, des armes biologiques et chimiques ou 
du nucl&eacute;aire maritime, directement ou indirectement, sont strictement 
interdites. Les exportations ou r&eacute;exportations vers les pays sous embargo 
am&eacute;ricain, ou vers des entit&eacute;s figurant sur les listes d'exclusion 
d'exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non 
exhaustive, la liste de personnes qui font objet d'un ordre de ne pas 
participer, d'une fa&ccedil;on directe ou indirecte, aux exportations des 
produits ou des services qui sont r&eacute;gis par la l&eacute;gislation 
am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la 
liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont 
rigoureusement interdites.

<p>LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS, 
D&Eacute;CLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES, 
DANS LA MESURE AUTORIS&Eacute;E PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT TOUTE 
GARANTIE IMPLICITE RELATIVE &Agrave; LA QUALITE MARCHANDE, &Agrave; L'APTITUDE 
&Agrave; UNE UTILISATION PARTICULIERE OU &Agrave; L'ABSENCE DE 
CONTREFA&Ccedil;ON.

<hr> <br>
 
</body>
</html>
